micropython/micropython/ports/psoc-edge/machine_uart.c
    #define PIN_AF_CONFIG_INDEX_NONE (0xFF)
    uint8_t pin_af_conf_rts_index = PIN_AF_CONFIG_INDEX_NONE;
    if (flow & UART_FLOW_CONTROL_RTS) {
        pin_af_conf_rts_index = pin_num;
        pin_num++;
        uart_pins_af_config[pin_af_conf_rts_index] = MP_HAL_PIN_AF_CONF_INIT_GPIO_SIGNAL(CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_UART_RTS);
        if (args[ARG_rts].u_obj != mp_const_none) {
            mp_hal_pin_obj_t rts_pin = mp_hal_get_pin_obj(args[ARG_rts].u_obj);
            MP_HAL_PIN_AF_CONF_SET_PIN_AF(uart_pins_af_config[pin_af_conf_rts_index], rts_pin);
        }
    }

    uint8_t pin_af_conf_cts_index = PIN_AF_CONFIG_INDEX_NONE;
    if (flow & UART_FLOW_CONTROL_CTS) {
        pin_af_conf_cts_index = pin_num;
        pin_num++;
        uart_pins_af_config[pin_af_conf_cts_index] = MP_HAL_PIN_AF_CONF_INIT_GPIO_SIGNAL(CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_UART_CTS);
        if (args[ARG_cts].u_obj != mp_const_none) {
            mp_hal_pin_obj_t cts_pin = mp_hal_get_pin_obj(args[ARG_cts].u_obj);
            MP_HAL_PIN_AF_CONF_SET_PIN_AF(uart_pins_af_config[pin_af_conf_cts_index], cts_pin);
        }
    }

    /* -- Resolve ID - pin match -- */
    uint8_t fn_unit = uart_id;
    mp_hal_periph_pins_af_resolve_fn_unit(uart_pins_af_config, pin_num, MACHINE_PIN_AF_FN_UART, (machine_pin_af_unit_t *)&fn_unit);

    /* -- Resolve not provided AF pins -- */
    mp_hal_periph_pins_af_resolve_pin_af(uart_pins_af_config, pin_num, (machine_pin_af_unit_t)fn_unit);

    /* -- Baudrate -- */
    uint32_t baudrate = (uint32_t)args[ARG_baudrate].u_int;
    if (baudrate == 0U) {
        mp_raise_ValueError(MP_ERROR_TEXT("baudrate must be non-zero"));
    }

    /* -- Data bits -- */
    uint8_t bits = args[ARG_bits].u_int;
    /**
     * TODO: Add support for 7 (or below <8 bits) and 9 bits.
     */
    if (bits != 8) {
        mp_raise_ValueError(MP_ERROR_TEXT("bits must be 8"));
    }

    /* -- Parity -- */
    mp_obj_t parity_arg = args[ARG_parity].u_obj;
    uint8_t parity;
    if (parity_arg == mp_const_none) {
        parity = (uint8_t)CY_SCB_UART_PARITY_NONE;
    } else {
        int p = mp_obj_get_int(parity_arg);
        if (p == 0) {
            parity = (uint8_t)CY_SCB_UART_PARITY_EVEN;
        } else if (p == 1) {
            parity = (uint8_t)CY_SCB_UART_PARITY_ODD;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("parity must be None, 0 (even) or 1 (odd)"));
        }
    }

    /* -- Stop bits -- */
    int stop_arg = args[ARG_stop].u_int;
    uint8_t stop;
    if (stop_arg == 1) {
        stop = (uint8_t)CY_SCB_UART_STOP_BITS_1;
    } else if (stop_arg == 2) {
        stop = (uint8_t)CY_SCB_UART_STOP_BITS_2;
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("stop bits must be 1 or 2"));
    }

    /* -- Timeouts -- */
    uint32_t timeout_ms = args[ARG_timeout].u_int;
    if (timeout_ms < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("timeout must be non-negative"));
    }

    uint32_t timeout_char_ms = args[ARG_timeout_char].u_int;
    if (timeout_char_ms < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("timeout_char must be non-negative"));
    }
    /* Make sure timeout_char is at least as long as a whole character (13 bits to be safe). */
    uint32_t min_timeout_char = 13000 / baudrate + 1;
    if (timeout_char_ms < min_timeout_char) {
        timeout_char_ms = min_timeout_char;
    }

    machine_uart_obj_t *self = *self_ptr;

    /* -- Object allocation -- */
    bool is_new;
    bool is_make_obj_required = (*self_ptr == NULL) ? true : false;
    if (is_make_obj_required) {
        machine_uart_obj_make_or_reuse(self_ptr, fn_unit, &is_new);
        self = *self_ptr;
    }

    /* -- Reinitialization reset -- */
    /* For reused UART() object or init() path */
    if (!is_new) {
        machine_uart_hw_deinit(self);
        m_del(uint8_t, self->rx_ringbuf.buf, self->rx_ringbuf.size);
    }

    /* -- UART params init -- */
    self->tx = uart_pins_af_config[0].pin;
    self->rx = uart_pins_af_config[1].pin;
    self->rts = (pin_af_conf_rts_index != PIN_AF_CONFIG_INDEX_NONE) ? uart_pins_af_config[pin_af_conf_rts_index].pin : MP_OBJ_NULL;
    self->cts = (pin_af_conf_cts_index != PIN_AF_CONFIG_INDEX_NONE) ? uart_pins_af_config[pin_af_conf_cts_index].pin : MP_OBJ_NULL;
    self->flow = flow;
    self->baudrate = baudrate;
    self->bits = bits;
    self->parity = parity;
    self->stop = stop;
    self->timeout_ms = timeout_ms;
    self->timeout_char_ms = timeout_char_ms;

    /* -- IRQ init -- */
    #if MICROPY_PY_MACHINE_UART_IRQ
    self->mp_irq_obj = NULL;
    self->mp_irq_trigger = 0;
    self->mp_irq_flags = 0;
    #endif

    /* -- Initialise hardware -- */
    nlr_buf_t nlr;
    if (nlr_push(&nlr) == 0) {
        ringbuf_alloc(&self->rx_ringbuf, args[ARG_rxbuf].u_int);
        mp_hal_periph_pins_af_init(uart_pins_af_config, pin_num);
        machine_uart_baudrate_set(self);
        machine_uart_hw_init(self);
        nlr_pop();
    } else {
        // Ensure partially-initialized instances are fully released on init failure.
        machine_uart_hw_deinit(self);
        m_del(uint8_t, self->rx_ringbuf.buf, self->rx_ringbuf.size);
        nlr_raise(nlr.ret_val);
    }
}

static mp_obj_t mp_machine_uart_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, MP_OBJ_FUN_ARGS_MAX, true);

    /**
     * Only the constructor takes the id.
     * Its validation together with the rest of the arguments is
     * delegated to machine_uart_init_implt() which also allocates
     * the object self = NULL.
    */
    int uart_id = MACHINE_PIN_AF_UNIT_NONE;
    size_t init_n_args = n_args;
    const mp_obj_t *init_args = args;
    if (n_args > 0 && mp_obj_is_int(args[0])) {
        uart_id = mp_obj_get_int(args[0]);
        if (uart_id < 0 || uart_id >= MICROPY_PY_MACHINE_SCB_NUM_ENTRIES) {
            mp_raise_ValueError(MP_ERROR_TEXT("UART id out of range"));
        }
        init_n_args = n_args - 1;
        init_args = args + 1;
    } else if (n_args > 0) {
        mp_raise_TypeError(MP_ERROR_TEXT("UART id must be an integer"));
    }

