micropython/micropython/ports/psoc-edge/machine_uart.c
static void machine_uart_irq_scb_config(machine_uart_obj_t *self, bool enable) {
    if (enable) {
        /**
         * CY_SCB_RX_INTR_NOT_EMPTY is always enabled.
         */
        if (self->mp_irq_trigger & CY_SCB_RX_INTR_UART_BREAK_DETECT) {
            /**
             * Clear any stale sticky status before unmasking to prevent a
             * spurious ISR from a break that occurred before this irq() call.
             */
            Cy_SCB_ClearRxInterrupt(self->scb_obj->scb, CY_SCB_RX_INTR_UART_BREAK_DETECT);
            Cy_SCB_SetRxInterruptMask(self->scb_obj->scb, CY_SCB_RX_INTR_UART_BREAK_DETECT | CY_SCB_RX_INTR_NOT_EMPTY);
        }
        if (self->mp_irq_trigger & CY_SCB_TX_INTR_UART_DONE) {
            /**
             * Clear any stale sticky status before unmasking to prevent a
             * spurious ISR from a TX done that occurred before this irq() call.
             */
            Cy_SCB_ClearTxInterrupt(self->scb_obj->scb, CY_SCB_TX_INTR_UART_DONE);
            Cy_SCB_SetTxInterruptMask(self->scb_obj->scb, CY_SCB_TX_INTR_UART_DONE);
        }
    } else {
        /**
         * If disabling, we want to keep the CY_SCB_RX_INTR_NOT_EMPTY
         * enabled to be able to fill the RX ring buffer and avoid data loss.
         */
        Cy_SCB_SetRxInterruptMask(self->scb_obj->scb, CY_SCB_RX_INTR_NOT_EMPTY);
        Cy_SCB_SetTxInterruptMask(self->scb_obj->scb, 0);
    }
}

static mp_uint_t uart_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    machine_uart_irq_scb_config(self, false);
    self->mp_irq_trigger = new_trigger;
    machine_uart_irq_scb_config(self, true);
    return 0;
}

static mp_uint_t uart_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (info_type == MP_IRQ_INFO_FLAGS) {
        return self->mp_irq_flags;
    } else if (info_type == MP_IRQ_INFO_TRIGGERS) {
        return self->mp_irq_trigger;
    }
    return 0;
}

const mp_irq_methods_t uart_irq_methods = {
    .trigger = uart_irq_trigger,
    .info = uart_irq_info,
};

static mp_irq_obj_t *mp_machine_uart_irq(machine_uart_obj_t *self, bool any_args, mp_arg_val_t *args) {
    if (self->mp_irq_obj == NULL) {
        self->mp_irq_trigger = 0;
        self->mp_irq_obj = mp_irq_new(&uart_irq_methods, MP_OBJ_FROM_PTR(self));
    }

    if (any_args) {
        /* Check the handler */
        mp_obj_t handler = args[MP_IRQ_ARG_INIT_handler].u_obj;
        if (handler != mp_const_none && !mp_obj_is_callable(handler)) {
            mp_raise_ValueError(MP_ERROR_TEXT("handler must be None or callable"));
        }

        /* Check the trigger */
        mp_uint_t trigger = args[MP_IRQ_ARG_INIT_trigger].u_int;
        mp_uint_t not_supported = trigger & ~MP_UART_ALLOWED_FLAGS;
        if (trigger != 0 && not_supported) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("trigger 0x%08x unsupported"), not_supported);
        }

        /* Reconfigure user IRQs */
        machine_uart_irq_scb_config(self, false);
        self->mp_irq_obj->handler = handler;
        self->mp_irq_obj->ishard = args[MP_IRQ_ARG_INIT_hard].u_bool;
        self->mp_irq_trigger = trigger;
        machine_uart_irq_scb_config(self, true);
    }

    return self->mp_irq_obj;
}
#endif

/******************************************************************************/
// Static REPL UART instance enablement

machine_uart_obj_t repl_uart_obj;
static uint8_t repl_uart_buf[MICROPYTHON_REPL_RINGBUF_SIZE];

void machine_uart_repl_init() {
    repl_uart_obj.tx = MICROPYTHON_REPL_UART_TX_PIN;
    repl_uart_obj.rx = MICROPYTHON_REPL_UART_RX_PIN;

    mp_hal_pin_af_config_t uart_pins_config[2] = {
        MP_HAL_PIN_AF_CONF_INIT(repl_uart_obj.tx, CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_UART_TX),
        MP_HAL_PIN_AF_CONF_INIT(repl_uart_obj.rx, CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_UART_RX),
    };

    uint8_t scb_unit = uart_pins_config[0].af->unit;

    repl_uart_obj.scb_obj = machine_scb_obj_alloc(scb_unit, &repl_uart_obj, machine_uart_scb_isr);
    repl_uart_obj.id = scb_unit;
    mp_hal_periph_pins_af_init(uart_pins_config, 2);

    repl_uart_obj.baudrate = DEFAULT_UART_BAUDRATE;
    machine_uart_baudrate_set(&repl_uart_obj);

    repl_uart_obj.bits = DEFAULT_UART_BITS;
    repl_uart_obj.parity = CY_SCB_UART_PARITY_NONE;
    repl_uart_obj.stop = CY_SCB_UART_STOP_BITS_1;
    repl_uart_obj.timeout_ms = 0;
    repl_uart_obj.timeout_char_ms = 13000 / repl_uart_obj.baudrate + 1;

    repl_uart_obj.rx_ringbuf.buf = repl_uart_buf;
    repl_uart_obj.rx_ringbuf.size = sizeof(repl_uart_buf);

    #if MICROPY_PY_MACHINE_UART_IRQ
    repl_uart_obj.mp_irq_obj = NULL;
    repl_uart_obj.mp_irq_trigger = 0;
    repl_uart_obj.mp_irq_flags = 0;
    #endif

    machine_uart_hw_init(&repl_uart_obj);
}

int machine_uart_repl_readchar(void) {
    for (;;) {
        int c = ringbuf_get(&repl_uart_obj.rx_ringbuf);
        if (c != -1) {
            return c;
        }
        mp_event_handle_nowait();
    }
}

void machine_uart_repl_write(const void *buf_in, mp_uint_t size) {
    int errcode;
    mp_machine_uart_write(&repl_uart_obj, buf_in, size, &errcode);
}

uintptr_t machine_uart_repl_ioctl(uintptr_t arg) {
    int errcode;
    return mp_machine_uart_ioctl(&repl_uart_obj, MP_STREAM_POLL, arg, &errcode);
}
